Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode
An enumerated type indicates the circuit path mode
Since:
2018
Since:
2018

Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.AllDevices
The circuit path connects to all the devices in the circuits, this mode is compatible to the legacy behavior.

Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.FarthestDevice
The circuit path connects to the farthest devices.

Autodesk.Revit.DB.Electrical.ElectricalCircuitPathMode.Custom
The circuit path is customized by user.